/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Learn-Wiring-with-Arduino-Mega/.
*/
/*
Αυτός ο κώδικας σχεδιάστηκε και εκτελέστηκε στο πρόγραμμα Arduino έκδοσης 1.8.13
Σχεδιάστηκε για χρήση με το Arduino Mega 2560
*/

//Blink led 

#define x 10           //Δηλωση μεταβλητής για αρχικοποιηση pin
void setup() {        //η συνάρτηση εγκατάστασης εκτελείται μία φορά όταν πατήσετε επαναφορά ή ενεργοποιήσετε την πλακέτα
pinMode(x, OUTPUT);  //pin x = 10 δήλωση ως έξοδος
}

void loop() {               //η λειτουργία βρόχου εκτελείται ξανά και ξανά για πάντα
  digitalWrite(x, HIGH);   //ανάβει το LED (HIGH είναι το επίπεδο τάσης)
  delay(100);             //περιμένει για 100ms = 0.1 sec
  digitalWrite(x, LOW);  //σβήνει το LED κάνοντας την τάση χαμηλή (LOW)
  delay(100);           //περιμένει για 100ms = 0.1 sec
}