/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Learn-Wiring-with-Arduino-Mega/.
*/
/*
Αυτός ο κώδικας σχεδιάστηκε και εκτελέστηκε στο πρόγραμμα Arduino έκδοσης 1.8.13
Σχεδιάστηκε για χρήση με το Arduino Mega 2560
*/

//For

#define led 10      //Αρχικοποιησή led = 10 pin

void setup() {
    pinMode(led, OUTPUT);             //Δήλωση led ως έξοδο
}

void loop() {
    for(int i = 0; i < 1000; i++){ //for μέχρι 1000
      digitalWrite(led, HIGH);    //Δίνει μια λογική τιμή 1 (ΥΨΗΛΗ) στο led, δηλαδή το ανάβει.
      delay(100);                //περιμένει για 100ms = 0.1sec
      digitalWrite(led, LOW);   //σβήστε το LED κάνοντας την τάση χαμηλή
      delay(100);              //περιμένει για 100ms = 0.1sec
    }

}