/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Learn-Wiring-with-Arduino-Mega/.
*/
/*
Αυτός ο κώδικας σχεδιάστηκε και εκτελέστηκε στο πρόγραμμα Arduino έκδοσης 1.8.13
Σχεδιάστηκε για χρήση με το Arduino Mega 2560
*/

//Γειά σου Κόσμε

void setup() {        //Συνάρτηση αρχικοποίησης παραμέτρων και υλικών συστήματος.
                     //Αρχικοποιήση σειριακής θύρας: 
Serial.begin(9600); //Είναι ο ρυθμός μετάδοσης σε bits ανά δευτερόλεπτο (για Serial).
}

void loop() {    //Κύρια επαναλαμβανόμενη συνάρτηση
Serial.println("Γειά σου Κόσμε");  //Εμφάνιση μηνύματος στην σειριακή
}