/*
Αυτός ο κωδικός σχεδιάστηκε από τον Κωνσταντίνο Σάκκα στις 7 Αυγούστου 2020.
Προορίζεται για ακαδημαϊκή χρήση στο Τμήμα Πληροφορικής και Τηλεπικοινωνιών του Πανεπιστημίου
Ιωαννίνων και του github https://ksakkas.github.io/Learn-Wiring-with-Arduino-Mega/.
*/
/*
Αυτός ο κώδικας σχεδιάστηκε και εκτελέστηκε στο πρόγραμμα Arduino έκδοσης 1.8.13
Σχεδιάστηκε για χρήση με το Arduino Mega 2560
*/

//Η Println

void setup() {
  Serial.begin(9600); //Είναι ο ρυθμός μετάδοσης σε bits ανά δευτερόλεπτο (για Serial).
}

void loop() {
  Serial.println("Konstantinos Sakkas");   //Εμφάνιση μηνύματος (με αλλαγή γραμμής)
  Serial.println("0000");                 //Εμφάνιση μηνύματος (με αλλαγή γραμμής)
}